app/controllers/books_controller.rb

SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books"  ORDER BY created_at_DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Fantasy"]]
SELECT "books".* FROM "books" WHERE "books"."category_id" = ?  ORDER BY created_at DESC  [["category_id", 1]]
---
		def index
		if params[:category].blank?
		@books= Book.all.order("created_at DESC")
		else
			@category_id = Category.find_by(name: params[:category]).id
			@books= Book.where(:category_id => @category_id).order"created_at DESC"

SELECT "categories".* FROM "categories"
---
		def new
		@book=current_user.books.build
		@categories=Category.all.map { |c| [c.name,c.id] }

INSERT INTO "books" ("title", "description", "author", "book_img_file_name", "book_img_content_type", "book_img_file_size", "book_img_updated_at", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
		def create
		@book=current_user.books.build(book_params)
		@book.category_id = params[:category_id]


			if @book.save

UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Steve Jobs Biography Nigger"], ["updated_at", "2016-06-28 07:38:11.898457"], ["id", 1]]
---
		def update
			@book.category_id = params[:category_id]
			if @book.update(book_params)